# 6021 
# 알파벳과 숫자로 이루어진 단어 1개가 입력된다.
# 입력받은 단어의 각 문자를 한 줄에 한 문자씩 분리해 출력한다.

s = input()
i = 0
while i <= len(s) :
    print(s[i])
    i += 1

# 6022
# 6자리의 연월일(YYMMDD)을 입력받아 나누어 출력해보자.

s = input()
print(s[0:2], s[2:4], s[4:6])

# 6023
# 시:분:초 형식으로 시간이 입력될 때 분만 출력해보자.

s = input().split(':')

print(s[1])

# 6024
# 알파벳 문자와 숫자로 이루어진 단어 2개를 입력받아
# 순서대로 붙여 출력하는 프로그램을 작성해보자.

w1, w2 = input().split()
s = w1 + w2
print(s)

# 6025
# 정수 2개를 입력받아
# 합을 출력하는 프로그램을 작성해보자.

a, b = input().split()
c = int(a) + int(b)
print(c)